---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.ThermalResistance
source: html/a0f83177-d9a3-4153-3584-023cff07e6db.htm
---
# Autodesk.Revit.DB.SpecTypeId.ThermalResistance Property

Thermal Resistance, in discipline Energy.

## Syntax (C#)
```csharp
public static ForgeTypeId ThermalResistance { get; }
```